Can't switch type to Curtain Wall after Edit Elevation Profile.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotSwitchToCurtainWall { get; }
  Visual Basic
Public Shared ReadOnly Property CannotSwitchToCurtainWall As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotSwitchToCurtainWall {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace